Insights to be drawn -
1. Get all the Earth meteorites that fell before the year 2000
2. Get all the earth meteorites co-ordinates who fell before the year 1970
3. Assuming that the mass of the earth meteorites was in kg, get all those whose mass was more than 10000kg

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import requests
import numpy as np
import json
from datetime import datetime

response = json.loads(requests.get("https://data.nasa.gov/resource/y77d-th95.json").text)

In [2]:
df = pd.DataFrame(pd.json_normalize(response))

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   name                         1000 non-null   object
 1   id                           1000 non-null   object
 2   nametype                     1000 non-null   object
 3   recclass                     1000 non-null   object
 4   mass                         972 non-null    object
 5   fall                         1000 non-null   object
 6   year                         999 non-null    object
 7   reclat                       988 non-null    object
 8   reclong                      988 non-null    object
 9   geolocation.type             988 non-null    object
 10  geolocation.coordinates      988 non-null    object
 11  :@computed_region_cbhk_fwbd  133 non-null    object
 12  :@computed_region_nnqa_25f4  134 non-null    object
dtypes: object(13)
memory usage: 101.7+ KB

In [4]:
# Renaming "geolocation.coordinates" to "point coordinates"

df.rename(columns={"geolocation.coordinates": "point coordinates"}, inplace=True)

In [5]:
df['year']

0      1880-01-01T00:00:00.000
1      1951-01-01T00:00:00.000
2      1952-01-01T00:00:00.000
3      1976-01-01T00:00:00.000
4      1902-01-01T00:00:00.000
                ...
995    1934-01-01T00:00:00.000
996    2011-01-01T00:00:00.000
997    1869-01-01T00:00:00.000
998    1922-01-01T00:00:00.000
999    1905-01-01T00:00:00.000
Name: year, Length: 1000, dtype: object

In [6]:
# Typecasting 'year' to datetime

df['year'] = pd.to_datetime(df['year'], format='%Y-%m-%dT%H:%M:%S.%f', errors='coerce')

### Get all the Earth meteorites that fell before the year 2000

In [8]:
df['fall'].unique()

array(['Fell', 'Found'], dtype=object)

In [36]:
df[(df['year'] < pd.Timestamp(2000,1,1)) & (df['fall']=='Fell')].reset_index(drop=True) [['name', 'fall', 'year']]

          name  fall       year
0       Aachen  Fell 1880-01-01
1       Aarhus  Fell 1951-01-01
2         Abee  Fell 1952-01-01
3     Acapulco  Fell 1976-01-01
4      Achiras  Fell 1902-01-01
..         ...   ...        ...
907   Timochin  Fell 1807-01-01
908   Tirupati  Fell 1934-01-01
909      Tjabe  Fell 1869-01-01
910   Tjerebon  Fell 1922-01-01
911  Tomakovka  Fell 1905-01-01

[912 rows x 3 columns]

### Get all the earth meteorites co-ordinates who fell before the year 1970

In [35]:
df[(df['year'] < pd.Timestamp(1970,1,1)) & (df['fall']=='Fell')].reset_index(drop=True) [['point coordinates', 'fall', 'year']]

         point coordinates  fall       year
0        [6.08333, 50.775]  Fell 1880-01-01
1     [10.23333, 56.18333]  Fell 1951-01-01
2         [-113, 54.21667]  Fell 1952-01-01
3      [-64.95, -33.16667]  Fell 1902-01-01
4             [71.8, 32.1]  Fell 1919-01-01
..                     ...   ...        ...
758           [35.2, 54.5]  Fell 1807-01-01
759   [79.41667, 13.63333]  Fell 1934-01-01
760  [111.53333, -7.08333]  Fell 1869-01-01
761  [106.58333, -6.66667]  Fell 1922-01-01
762      [34.76667, 47.85]  Fell 1905-01-01

[763 rows x 3 columns]

### Assuming that the mass of the earth meteorites was in kg, get all those whose mass was more than 10000kg

In [39]:
df['mass'].isna().sum()

28

In [43]:
# Typecasting mass to float
df['mass'] = df['mass'].fillna(0).astype(np.float64)

In [49]:
temp3 = df[df['mass'] > 10000].reset_index(drop=True) [['name', 'mass']]
temp3

           name      mass
0          Abee  107000.0
1          Agen   30000.0
2           AÃ¯r   24000.0
3       Akyumak   50000.0
4    Alfianello  228000.0
..          ...       ...
238   Tieschitz   28000.0
239      Tilden   74800.0
240    Timochin   65500.0
241       Tjabe   20000.0
242    Tjerebon   16500.0

[243 rows x 2 columns]